In [1]:
import pandas as pd
import numpy as np

# Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
#The built-in Python None value is also treated as NA in object arrays
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
#NA handling methods
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [7]:
string_data.fillna('Hello')

0        Hello
1    artichoke
2        Hello
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

## Filtering Out Missing Data

In [10]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
#This is equivalent to
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
#dropna by default drops any row containing a missing value
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
#Passing how='all' will only drop rows that are all NA
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
#To drop columns in the same way, pass axis=1
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.135284       NaN       NaN
1  0.898752       NaN       NaN
2 -0.010602       NaN  0.789873
3 -1.779791       NaN  0.147349
4 -1.368473  0.108753 -0.140141
5 -0.348149  0.602698 -1.142061
6  1.500587 -0.231807 -0.108044

In [18]:
df.dropna()

          0         1         2
4 -1.368473  0.108753 -0.140141
5 -0.348149  0.602698 -1.142061
6  1.500587 -0.231807 -0.108044

In [19]:
#using thresh argument
df.dropna(thresh=2)
#thresh = 2 means rows with atleast 2 observations

          0         1         2
2 -0.010602       NaN  0.789873
3 -1.779791       NaN  0.147349
4 -1.368473  0.108753 -0.140141
5 -0.348149  0.602698 -1.142061
6  1.500587 -0.231807 -0.108044

In [20]:
df.dropna(thresh=3)

          0         1         2
4 -1.368473  0.108753 -0.140141
5 -0.348149  0.602698 -1.142061
6  1.500587 -0.231807 -0.108044

In [21]:
df.dropna(thresh=4)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [25]:
df.dropna(thresh=1)

          0         1         2
0 -0.135284       NaN       NaN
1  0.898752       NaN       NaN
2 -0.010602       NaN  0.789873
3 -1.779791       NaN  0.147349
4 -1.368473  0.108753 -0.140141
5 -0.348149  0.602698 -1.142061
6  1.500587 -0.231807 -0.108044

## Filling In Missing Data

In [26]:
#Calling fillna with a constant replaces missing values with that value
df.fillna(0)

          0         1         2
0 -0.135284  0.000000  0.000000
1  0.898752  0.000000  0.000000
2 -0.010602  0.000000  0.789873
3 -1.779791  0.000000  0.147349
4 -1.368473  0.108753 -0.140141
5 -0.348149  0.602698 -1.142061
6  1.500587 -0.231807 -0.108044

In [27]:
#Calling fillna with a dict, you can use a different fill value for each column
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.135284  0.500000  0.000000
1  0.898752  0.500000  0.000000
2 -0.010602  0.500000  0.789873
3 -1.779791  0.500000  0.147349
4 -1.368473  0.108753 -0.140141
5 -0.348149  0.602698 -1.142061
6  1.500587 -0.231807 -0.108044

In [28]:
#fillna returns a new object, but you can modify the existing object in-place
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.135284  0.000000  0.000000
1  0.898752  0.000000  0.000000
2 -0.010602  0.000000  0.789873
3 -1.779791  0.000000  0.147349
4 -1.368473  0.108753 -0.140141
5 -0.348149  0.602698 -1.142061
6  1.500587 -0.231807 -0.108044

In [29]:
#The same interpolation methods available for reindexing can be used with fillna
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  2.699482 -0.668898 -2.170086
1 -1.416867  0.339816  0.228332
2  0.499763       NaN  0.970281
3 -0.523141       NaN -0.738458
4 -0.974615       NaN       NaN
5 -0.682184       NaN       NaN

In [30]:
df.fillna(method='ffill')

          0         1         2
0  2.699482 -0.668898 -2.170086
1 -1.416867  0.339816  0.228332
2  0.499763  0.339816  0.970281
3 -0.523141  0.339816 -0.738458
4 -0.974615  0.339816 -0.738458
5 -0.682184  0.339816 -0.738458

In [31]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  2.699482 -0.668898 -2.170086
1 -1.416867  0.339816  0.228332
2  0.499763  0.339816  0.970281
3 -0.523141  0.339816 -0.738458
4 -0.974615       NaN -0.738458
5 -0.682184       NaN -0.738458

In [32]:
#with fillna we can do alot of creative things
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# Data Transformation

## Removing Duplicates

In [33]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [34]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
#Relatedly, drop_duplicates returns a DataFrame where the duplicated array is False
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
#wanted to filter duplicates only based on the 'k1' column
data.drop_duplicates('k1')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
#duplicated and drop_duplicates by default keep the first observed value combination.
#Passing keep='last' will return the last one
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [41]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                              'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [43]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [45]:
#mapping
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [46]:
#We could also have passed a function that does all the work
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [47]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [48]:
#replacing -999 from series with NaN
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [49]:
#If you want to replace multiple values at once, you instead pass a list and then the substitute value
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [50]:
#To use a different replacement for each value, pass a list of substitutes
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
#The argument passed can also be a dict
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [52]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [53]:
#Like a Series, the axis indexes have a map method
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [55]:
#You can assign to index, modifying the DataFrame in-place
data.index = data.index.map(transform)

In [56]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [57]:
#If you want to create a transformed version of a dataset without modifying the original, a useful method is rename
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [58]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
#Notably, rename can be used in conjunction with a dict-like object providing new values
#for a subset of the axis labels
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [60]:
#modifing the original df using rename
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [61]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

In [62]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [63]:
#Lets divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
#do so, you have to use cut, a function in pandas
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [64]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [65]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [66]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [67]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [68]:
#You can also pass your own bin names by passing a list or array to the labels option
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [69]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)
#The precision=2 option limits the decimal precision to two digits

[(0.18, 0.36], (0.18, 0.36], (0.18, 0.36], (0.36, 0.53], (0.36, 0.53], ..., (0.53, 0.7], (0.011, 0.18], (0.011, 0.18], (0.53, 0.7], (0.011, 0.18]]
Length: 20
Categories (4, interval[float64]): [(0.011, 0.18] < (0.18, 0.36] < (0.36, 0.53] < (0.53, 0.7]]

In [70]:
#qcut uses sample quantiles instead, by definition you will obtain roughly equal-size bins
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(-3.4379999999999997, -0.677], (-0.677, 0.0239], (-0.677, 0.0239], (-3.4379999999999997, -0.677], (0.0239, 0.665], ..., (-3.4379999999999997, -0.677], (-0.677, 0.0239], (-3.4379999999999997, -0.677], (0.665, 3.52], (-0.677, 0.0239]]
Length: 1000
Categories (4, interval[float64]): [(-3.4379999999999997, -0.677] < (-0.677, 0.0239] < (0.0239, 0.665] < (0.665, 3.52]]

In [71]:
pd.value_counts(cats)

(0.665, 3.52]                    250
(0.0239, 0.665]                  250
(-0.677, 0.0239]                 250
(-3.4379999999999997, -0.677]    250
dtype: int64

In [72]:
#Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive)
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-3.4379999999999997, -1.239], (-1.239, 0.0239], (-1.239, 0.0239], (-1.239, 0.0239], (0.0239, 1.334], ..., (-3.4379999999999997, -1.239], (-1.239, 0.0239], (-1.239, 0.0239], (0.0239, 1.334], (-1.239, 0.0239]]
Length: 1000
Categories (4, interval[float64]): [(-3.4379999999999997, -1.239] < (-1.239, 0.0239] < (0.0239, 1.334] < (1.334, 3.52]]

## Detecting and Filtering Outliers

In [73]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034344     0.008641    -0.018400    -0.020983
std       0.991505     1.032157     1.005928     1.002023
min      -3.254803    -3.669662    -3.505785    -3.460411
25%      -0.624818    -0.694536    -0.724501    -0.709647
50%       0.063272     0.000334    -0.026917    -0.046541
75%       0.719814     0.703869     0.640948     0.681630
max       3.048436     3.138411     3.172432     3.026495

In [75]:
#Suppose you wanted to find values in one of the columns exceeding 3 in absolute value
col = data[2]
col[np.abs(col)>3]

117   -3.505785
636    3.172432
924    3.041985
Name: 2, dtype: float64

In [76]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
39  -0.485764  1.388279 -0.050022  3.026495
108  0.431389 -3.077282 -0.972268  0.894069
117  2.242555 -1.895405 -3.505785  1.309876
138 -0.603130  3.138411  0.109202 -0.201668
222  0.572440 -3.357226  1.607705  0.257669
268  3.048436  0.370825 -0.822765 -0.417543
271 -3.254803 -1.127113 -0.879145  0.622460
421  1.910777 -3.302511  2.404423 -0.358733
487 -0.566458 -3.669662  0.738970  0.029131
515 -1.751259 -3.247795 -0.582814 -0.210110
636  1.921616  0.325080  3.172432  1.319345
858  1.705696  0.453871 -1.276288 -3.460411
924 -0.163038 -0.084103  3.041985 -0.474613

In [77]:
#Values can be set based on these criteria. Here is code to cap values outside the interval 3 to 3
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034550     0.010158    -0.018109    -0.020549
std       0.990545     1.026546     1.003638     1.000465
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.624818    -0.694536    -0.724501    -0.709647
50%       0.063272     0.000334    -0.026917    -0.046541
75%       0.719814     0.703869     0.640948     0.681630
max       3.000000     3.000000     3.000000     3.000000

In [78]:
#The statement np.sign(data) produces 1 and 1 values based on whether the values
#in data are positive or negative
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0  1.0  1.0 -1.0
3  1.0  1.0  1.0 -1.0
4 -1.0  1.0  1.0 -1.0

## Permutation and Random Sampling

In [79]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([2, 3, 4, 1, 0])

In [80]:
#That array can then be used in iloc-based indexing or the equivalent take function
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [81]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3

In [82]:
#To select a random subset without replacement, you can use the sample method on Series and DataFrame
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [84]:
#To generate a sample with replacement (to allow repeat choices), pass replace=True to sample
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

1    7
0    5
1    7
0    5
4    4
0    5
3    6
1    7
3    6
1    7
dtype: int64

## Computing Indicator/Dummy Variables

In [85]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [86]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

# String Manipulation

## String Object Methods

In [88]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [89]:
#split is often combined with strip to trim whitespace (including line breaks)
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [90]:
#These substrings could be concatenated together with a two-colon delimiter using addition
first,second,third = pieces
first+'::'+second+'::'+third

'a::b::guido'

In [91]:
#But this isnt a practical generic method. A faster and more Pythonic way is to pass a
#list or tuple to the join method on the string '::'
'::'.join(pieces)

'a::b::guido'

In [92]:
#Using Pythons in keyword is the best way to detect a substring, though index and find can also be used
'guido' in val

True

In [93]:
val.index(',')

1

In [95]:
val.find(':')

-1

In [96]:
#Note the difference between find and index is that index raises an exception if the
#string isnt found (versus returning 1)
val.index(':')

ValueError: substring not found

In [97]:
#Relatedly, count returns the number of occurrences of a particular substring
val.count(',')

2

In [98]:
#replace will substitute occurrences of one pattern for another. It is commonly used
#to delete patterns, too, by passing an empty string
val.replace(',','::')

'a::b:: guido'

In [99]:
val.replace(',',' ')

'a b  guido'

## Regular Expressions

In [100]:
import re
text = "foo bar\t baz \tqux"
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [101]:
#You can compile the regex yourself with re.compile, forming a reusable regex object
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [103]:
#If, instead, you wanted to get a list of all patterns matching the regex, you can use the findall method
regex.findall(text)

[' ', '\t ', ' \t']

In [104]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [105]:
#Using findall on the text produces a list of the email addresses
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [107]:
#search returns a special match object for the first email address in the text
m = regex.search(text)
m

In [108]:
text[m.start():m.end()]

'dave@google.com'

In [109]:
#regex.match returns None, as it only will match if the pattern occurs at the start of the string
print(regex.match(text))

None

In [110]:
#Relatedly, sub will return a new string with occurrences of the pattern replaced by the a new string
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [112]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern,flags=re.IGNORECASE)

In [113]:
#A match object produced by this modified regex returns a tuple of the pattern components with its groups method
m = regex.match('wesm@bright.net')
m

In [114]:
m.groups()

('wesm', 'bright', 'net')

In [115]:
#findall returns a list of tuples when the pattern has groups
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [116]:
#sub also has access to groups in each match using special symbols like \1 and \2
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectorized String Functions in pandas

In [117]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [118]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [119]:
#Series has array-oriented methods for string operations that skip NA values
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [120]:
#Regular expressions can be used, too, along with any re options like IGNORECASE
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [121]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [123]:
#There are a couple of ways to do vectorized element retrieval. Either use str.get or
#index into the str attribute
matches = data.str.match(pattern,flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [124]:
#To access elements in the embedded lists, we can pass an index to either of these functions
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [125]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [127]:
#You can similarly slice strings using this syntax
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object